"""Ответы на вопросы по ОПЕНСОРС."""

# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
# да
#
# 2. Напишите название понравившейся компании и ссылку на репозиторий
# Название компании: Google
# Ссылка: https://github.com/google/oss-fuzz-gen
#
# 3. Проект активно принимает стороннюю помощь?
# да, она каждый день принимает pr
#
# 4. Напишите второе улучшение которое вы сделали
# второе улучшение: исправление синнтаксических ошибок в файлах папки prompt
#
# 5. Посмотрите на коммиты в основной ветке, напишите общее количество
# 704
#
# 6. Когда был последний коммит?
# 07.06.2025
#
# 7. Сколько контрибьюторов у проекта?
# 27
#
# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
# коммитят каждый день
#
# 9. Сколько сейчас открытых ишью?
# 89
#
# 10. Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
# в соответствии с последними закрытыми ишьюсами, реагируют от нескольких часов до 5 дней
#
# 11. Ведётся ли активное обсуждение ишью?
# да, есть несколько последних ишьюсов, которые имеют большой дискуссионный блок
#
# 12. Есть ли недавно созданные ишью?
# да, 3 недели назад, также месяц
#
# 14. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
# да
#
# 15. Сколько сейчас открытых пул-реквестов?
# 64
#
# 16. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
# да, фактически в этот же день
#
# 17. Ведётся ли активное обсуждение пул-реквестов?
# в соответствии с последними закрытыми pr, в основном нет
#
# 18. Есть ли недавно отправленные пул-реквесты?
# да, вчера, позавчера
#
# 19. Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
# Вчера
